lovyan03/LovyanGFX/src/lgfx/platforms/LGFX_SPI_ESP32.hpp
      if (fullscroll) {
        _sw = _width;
        _sh = _height;
      }
      _clip_l = _clip_t = 0;
    }

    void beginTransaction_impl(void) override {
      if (_in_transaction) return;
      _in_transaction = true;
      begin_transaction();
    }

    void begin_transaction(void) {
      _fill_mode = false;
      std::uint32_t apb_freq = getApbFrequency();
      if (_last_apb_freq != apb_freq) {
        _last_apb_freq = apb_freq;
        _clkdiv_read  = FreqToClockDiv(apb_freq, _panel->freq_read);
        _clkdiv_fill  = FreqToClockDiv(apb_freq, _panel->freq_fill);
        _clkdiv_write = FreqToClockDiv(apb_freq, _panel->freq_write);
      }

      auto spi_mode = _panel->spi_mode;
      _user = (spi_mode == 1 || spi_mode == 2) ? SPI_CK_OUT_EDGE | SPI_USR_MOSI : SPI_USR_MOSI;
      std::uint32_t pin = (spi_mode & 2) ? SPI_CK_IDLE_EDGE : 0;

      spi::beginTransaction(_spi_host);

      if (_dma_channel) {
        _next_dma_reset = true;
      }

      *_spi_user_reg = _user;
      *reg(SPI_PIN_REG(_spi_port))  = pin;
      set_clock_write();

      cs_l();
      if (nullptr != _panel->fp_begin) { _panel->fp_begin(_panel, this); }
    }

    void endTransaction_impl(void) override
    {
      if (!_in_transaction) return;
      end_transaction();
      _in_transaction = false;
    }

    void end_transaction(void) {
      if (_auto_display && nullptr != _panel->fp_display) { _panel->fp_display(_panel, this); }
      if (nullptr != _panel->fp_end) { _panel->fp_end(_panel, this); }
      if (_spi_dlen == 16 && (_align_data)) write_data(0, 8);
      if (_panel->spi_cs < 0) {
        write_cmd(0); // NOP command
      }
      dc_h();
      spi::endTransaction(_spi_host, _panel->spi_cs);
#if defined (ARDUINO) // Arduino ESP32
      *_spi_user_reg = SPI_USR_MOSI | SPI_USR_MISO | SPI_DOUTDIN; // for other SPI device (SD)
#endif
    }

    void initDMA_impl(void) override
    {
      if (_dma_channel) {
        spi_dma_reset();
      }
    }

    void waitDMA_impl(void) override
    {
      wait_spi();
    }

    bool dmaBusy_impl(void) override
    {
      return *_spi_cmd_reg & SPI_USR;
    }

    void writePixelsDMA_impl(const void* data, std::int32_t length) override
    {
      write_bytes((const std::uint8_t*)data, length * _write_conv.bytes, true);
    }

    void writeBytes_impl(const std::uint8_t* data, std::int32_t length, bool use_dma) override
    {
      write_bytes((const std::uint8_t*)data, length, use_dma);
    }

    void readBytes_impl(std::uint8_t* dst, std::int32_t length) override
    {
      start_read();
      read_bytes(dst, length);
      end_read(false); // Don't use the CS operation.
    }

    void setWindow_impl(std::int32_t xs, std::int32_t ys, std::int32_t xe, std::int32_t ye) override
    {
      if (_fill_mode) {
        _fill_mode = false;
        wait_spi();
        set_clock_write();
      }
      set_window(xs, ys, xe, ye);
      write_cmd(_cmd_ramwr);
    }

    void drawPixel_impl(std::int32_t x, std::int32_t y) override
    {
      if (!_panel->fp_fillRect) {
        if (_in_transaction) {
          if (_fill_mode) {
            _fill_mode = false;
            wait_spi();
            set_clock_write();
          }
          set_window(x, y, x, y);
          write_cmd(_cmd_ramwr);
          write_data(_color.raw, _write_conv.bits);
          return;
        }

        begin_transaction();
        set_window(x, y, x, y);
        write_cmd(_cmd_ramwr);
        write_data(_color.raw, _write_conv.bits);
        end_transaction();
      }
      else
      {
        startWrite();
        _panel->fp_fillRect(_panel, this, x, y, 1, 1, _color.raw);
        endWrite();
      }
    }

    void writeFillRect_impl(std::int32_t x, std::int32_t y, std::int32_t w, std::int32_t h) override
    {
      if (!_panel->fp_fillRect) {
        if (_fill_mode) {
          _fill_mode = false;
          wait_spi();
          set_clock_write();
        }
        set_window(x, y, x+w-1, y+h-1);
        write_cmd(_cmd_ramwr);
        push_block(w*h, _clkdiv_write != _clkdiv_fill);
      }
      else
      {
        _panel->fp_fillRect(_panel, this, x, y, w, h, _color.raw);
      }
    }

    void pushBlock_impl(std::int32_t length) override
    {
      if (_panel->fp_pushBlock)
      {
        _panel->fp_pushBlock(_panel, this, length, _color.raw);
      }
      else
      {
        push_block(length);
      }
    }

    void push_block(std::int32_t length, bool fillclock = false)
    {
      auto bits = _write_conv.bits;
      std::uint32_t regbuf0 = _color.raw;
      if (length == 1) { write_data(regbuf0, bits); return; }

      length *= bits;          // convert to bitlength.
      std::uint32_t len = std::min(96, length); // 1st send length = max 12Byte (96bit). 
      bool bits16 = (bits == 16);

      std::uint32_t regbuf1;
      std::uint32_t regbuf2;
      // make 12Bytes data.
      if (bits16) {
        regbuf0 = regbuf0 | regbuf0 << 16;
        regbuf1 = regbuf0;
        regbuf2 = regbuf0;
      } else {
        if (_spi_dlen == 16 && length & 8) _align_data = !_align_data;
        regbuf0 = regbuf0      | regbuf0 << 24;
        regbuf1 = regbuf0 >> 8 | regbuf0 << 16;
        regbuf2 = regbuf0 >>16 | regbuf0 <<  8;
      }

      auto spi_w0_reg = _spi_w0_reg;
      dc_h();

      // copy to SPI buffer register
      spi_w0_reg[0] = regbuf0;
      spi_w0_reg[1] = regbuf1;
      spi_w0_reg[2] = regbuf2;

      set_write_len(len);

      if (fillclock) {
        set_clock_fill();  // fillmode clockup
        _fill_mode = true;
      }

      exec_spi();   // 1st send.
      if (0 == (length -= len)) return;

      std::uint32_t regbuf[7];
      regbuf[0] = regbuf0;
      regbuf[1] = regbuf1;
      regbuf[2] = regbuf2;
      regbuf[3] = regbuf0;
      regbuf[4] = regbuf1;
      regbuf[5] = regbuf2;
      regbuf[6] = regbuf0;

      // copy to SPI buffer register
      memcpy((void*)&spi_w0_reg[3], regbuf, 24);
      memcpy((void*)&spi_w0_reg[9], regbuf, 28);

      // limit = 64Byte / depth_bytes;
      // When 24bit color, 504 bits out of 512bit buffer are used.
      // When 16bit color, it uses exactly 512 bytes. but, it behaves like a ring buffer, can specify a larger size.
      std::uint32_t limit;
      if (bits16) {
        limit = (1 << 11);
        len = length & (limit - 1);
      } else {
        limit = 504;
        len = length % limit;
      }
      if (len) {
        wait_spi();
        set_write_len(len);
        exec_spi();                // 2nd send.
        if (0 == (length -= len)) return;
      }
      wait_spi();
      set_write_len(limit);
      exec_spi();
      while (length -= limit) {
        taskYIELD();
        wait_spi();
        exec_spi();
      }
    }

