lovyan03/LovyanGFX/src/lgfx/platforms/LGFX_SPI_ESP32.hpp
    void write_cmd(std::uint_fast8_t cmd)
    {
      if (_spi_dlen == 16) {
        if (_align_data) write_data(0, 8);
        cmd <<= 8;
      }
      std::uint32_t len = _spi_dlen - 1;
      auto spi_mosi_dlen_reg = _spi_mosi_dlen_reg;
      auto spi_w0_reg        = _spi_w0_reg;
      dc_l();
      *spi_mosi_dlen_reg = len;
      *spi_w0_reg = cmd;
      exec_spi();
    }

    void write_data(std::uint32_t data, std::uint32_t bit_length)
    {
      auto spi_w0_reg        = _spi_w0_reg;
      auto spi_mosi_dlen_reg = _spi_mosi_dlen_reg;
      dc_h();
      *spi_mosi_dlen_reg = bit_length - 1;
      *spi_w0_reg = data;
      exec_spi();
      if (_spi_dlen == 16 && (bit_length & 8)) _align_data = !_align_data;
    }

    __attribute__ ((always_inline)) inline 
    void write_cmd_data(const std::uint8_t* addr)
    {
      auto spi_mosi_dlen_reg = _spi_mosi_dlen_reg;
      auto spi_w0_reg        = _spi_w0_reg;
      if (_spi_dlen == 16 && _align_data)
      {
        _align_data = false;
        dc_h();
        *spi_mosi_dlen_reg = 8 - 1;
        *spi_w0_reg = 0;
        exec_spi();
      }

      do {
        std::uint32_t data = *addr++;
        if (_spi_dlen == 16) {
          data <<= 8;
        }
        std::uint32_t len = _spi_dlen - 1;
        dc_l();
        *spi_mosi_dlen_reg = len;
        *spi_w0_reg = data;
        exec_spi();
//        write_cmd(*addr++);
        std::uint_fast8_t numArgs = *addr++;
        if (numArgs)
        {
          data = *reinterpret_cast<const std::uint32_t*>(addr);
          if (_spi_dlen == 16)
          {
            if (numArgs > 2)
            {
              std::uint_fast8_t len = ((numArgs + 1) >> 1) + 1;
              std::uint_fast8_t i = 1;
              do
              {
                _spi_w0_reg[i] = addr[i * 2] << 8 | addr[i * 2 + 1] << 24;
              } while (++i != len);
            }
            data = (data & 0xFF) << 8 | (data >> 8) << 24;
            //write_data(addr[0] << 8 | addr[1] << 24, _spi_dlen * numArgs);
          }
          else
          {
            if (numArgs > 4)
            {
              memcpy((void*)&_spi_w0_reg[1], addr + 4, numArgs - 4);
            }
            //write_data(*reinterpret_cast<const std::uint32_t*>(addr), _spi_dlen * numArgs);
          }
          addr += numArgs;
          len = _spi_dlen * numArgs - 1;
          dc_h();
          *spi_mosi_dlen_reg = len;
          *spi_w0_reg = data;
          exec_spi();
        }
      } while (reinterpret_cast<const std::uint16_t*>(addr)[0] != 0xFFFF);
    }

    void set_window(std::uint_fast16_t xs, std::uint_fast16_t ys, std::uint_fast16_t xe, std::uint_fast16_t ye)
    {
//*
      std::uint8_t buf[16];
      if (auto b = _panel->getWindowCommands1(buf, xs, ys, xe, ye)) { write_cmd_data(b); }
      if (auto b = _panel->getWindowCommands2(buf, xs, ys, xe, ye)) { write_cmd_data(b); }
      return;
/*/
      std::uint32_t len;
      if (_spi_dlen == 8) {
        len = _len_setwindow - 1;
      } else {
        len = (_len_setwindow << 1) - 1;
        if (_align_data) write_data(0, 8);
      }
      auto spi_mosi_dlen_reg = _spi_mosi_dlen_reg;
      auto fp = fpGetWindowAddr;

      if (_xs != xs || _xe != xe) {
        auto cmd = _cmd_caset;
        if (_spi_dlen == 16) cmd <<= 8;
        std::uint32_t l  = _spi_dlen - 1;
        auto spi_w0_reg  = _spi_w0_reg;
        auto spi_cmd_reg = _spi_cmd_reg;
        dc_l();
        *spi_mosi_dlen_reg = l;
        *spi_w0_reg = cmd;
        *spi_cmd_reg = SPI_USR;

        std::uint32_t tmp = _colstart;

        tmp = fp(xs + tmp, xe + tmp);
        if (_spi_dlen == 16) {
          auto t = tmp >> 16;
          spi_w0_reg[1] = (t & 0xFF) << 8 | (t >> 8) << 24;
          tmp = (tmp & 0xFF) << 8 | (tmp >> 8) << 24;
        }
        dc_h();
        *spi_w0_reg = tmp;
        *spi_mosi_dlen_reg = len;
        *spi_cmd_reg = SPI_USR;
        _xs = xs;
        _xe = xe;
      }
      if (_ys != ys || _ye != ye) {
        auto cmd = _cmd_raset;
        if (_spi_dlen == 16) cmd <<= 8;
        std::uint32_t l  = _spi_dlen - 1;
        auto spi_w0_reg  = _spi_w0_reg;
        auto spi_cmd_reg = _spi_cmd_reg;
        dc_l();
        *spi_mosi_dlen_reg = l;
        *spi_w0_reg = cmd;
        *spi_cmd_reg = SPI_USR;

        std::uint32_t tmp = _rowstart;

        tmp = fp(ys + tmp, ye + tmp);
        if (_spi_dlen == 16) {
          auto t = tmp >> 16;
          spi_w0_reg[1] = (t & 0xFF) << 8 | (t >> 8) << 24;
          tmp = (tmp & 0xFF) << 8 | (tmp >> 8) << 24;
        }
        dc_h();
        *spi_w0_reg = tmp;
        *spi_mosi_dlen_reg = len;
        *spi_cmd_reg = SPI_USR;
        _ys = ys;
        _ye = ye;
      }
//*/
    }

    void start_read(void) {
      if (_spi_dlen == 16 && (_align_data)) write_data(0, 8);

      _fill_mode = false;
      std::uint32_t user = ((_panel->spi_mode_read == 1 || _panel->spi_mode_read == 2) ? SPI_CK_OUT_EDGE | SPI_USR_MISO : SPI_USR_MISO)
                    | (_panel->spi_3wire ? SPI_SIO : 0);
      std::uint32_t pin = (_panel->spi_mode_read & 2) ? SPI_CK_IDLE_EDGE : 0;
      dc_h();
      *_spi_user_reg = user;
      *reg(SPI_PIN_REG(_spi_port)) = pin;
      set_clock_read();
    }

    void end_read(bool cs_ctrl = true)
    {
      std::uint32_t pin = (_panel->spi_mode & 2) ? SPI_CK_IDLE_EDGE : 0;
      wait_spi();
      if (cs_ctrl) { cs_h(); }
      *_spi_user_reg = _user;
      *reg(SPI_PIN_REG(_spi_port)) = pin;
      if (cs_ctrl && _panel->spi_cs < 0) {
        write_cmd(0); // NOP command
      }
      set_clock_write();
      _fill_mode = false;

      if (cs_ctrl) { cs_l(); }
    }

    std::uint32_t read_data(std::uint32_t length)
    {
      set_read_len(length);
      exec_spi();
      wait_spi();
      return *_spi_w0_reg;

    }

    std::uint32_t read_command(std::uint_fast8_t command, std::uint32_t bitindex = 0, std::uint32_t bitlen = 8)
    {
      bitindex += _panel->len_dummy_read_rddid;
      startWrite();
      write_cmd(command);
      start_read();
      if (bitindex) read_data(bitindex);
      std::uint32_t res = read_data(bitlen);
      end_read();
      endWrite();
      return res;
    }

    void pushImage_impl(std::int32_t x, std::int32_t y, std::int32_t w, std::int32_t h, pixelcopy_t* param, bool use_dma) override
    {
      if (_panel->fp_pushImage != nullptr)
      {
        _panel->fp_pushImage(_panel, this, x, y, w, h, param);
      }
      else
      {
        push_image(x, y, w, h, param, use_dma);
      }
    }

    void push_image(std::int32_t x, std::int32_t y, std::int32_t w, std::int32_t h, pixelcopy_t* param, bool use_dma)
    {
      auto bits = _write_conv.bits;
      auto src_x = param->src_x;
      auto fp_copy = param->fp_copy;

      std::int32_t xr = (x + w) - 1;
      std::int32_t whb = w * h * bits >> 3;
      if (param->transp == ~0) {
        if (param->no_convert) {
          setWindow_impl(x, y, xr, y + h - 1);
          std::uint32_t i = (src_x + param->src_y * param->src_bitwidth) * bits >> 3;
          auto src = &((const std::uint8_t*)param->src_data)[i];
          if (_dma_channel && use_dma) {
            if (param->src_bitwidth == w) {
              _setup_dma_desc_links(src, w * h * bits >> 3);
            } else {
              _setup_dma_desc_links(src, w * bits >> 3, h, param->src_bitwidth * bits >> 3);
            }
            dc_h();
            set_write_len(whb << 3);
            *_spi_dma_out_link_reg = SPI_OUTLINK_START | ((int)(&_dmadesc[0]) & 0xFFFFF);
            spi_dma_transfer_active(_dma_channel);
            exec_spi();
            return;
          }
          if (param->src_bitwidth == w || h == 1) {
            if (_dma_channel && !use_dma && (64 < whb) && (whb <= 1024)) {
              auto buf = get_dmabuffer(whb);
              memcpy(buf, src, whb);
              write_bytes(buf, whb, true);
            } else {
              write_bytes(src, whb, use_dma);
            }
          } else {
            auto add = param->src_bitwidth * bits >> 3;
            do {
              write_bytes(src, w * bits >> 3, use_dma);
              src += add;
            } while (--h);
          }
        } else
        if (_dma_channel && (64 < whb)) {
          if (param->src_bitwidth == w && (whb <= 1024)) {
            auto buf = get_dmabuffer(whb);
            fp_copy(buf, 0, w * h, param);
            setWindow_impl(x, y, xr, y + h - 1);
            write_bytes(buf, whb, true);
          } else {
            std::int32_t wb = w * bits >> 3;
            auto buf = get_dmabuffer(wb);
            fp_copy(buf, 0, w, param);
            setWindow_impl(x, y, xr, y + h - 1);
            write_bytes(buf, wb, true);
            while (--h) {
              param->src_x = src_x;
              param->src_y++;
              buf = get_dmabuffer(wb);
              fp_copy(buf, 0, w, param);
              write_bytes(buf, wb, true);
            }
          }
        } else {
          setWindow_impl(x, y, xr, y + h - 1);
          do {
            write_pixels(w, param);
            param->src_x = src_x;
            param->src_y++;
          } while (--h);
        }
      } else {
        auto fp_skip = param->fp_skip;
        h += y;
        do {
          std::int32_t i = 0;
          while (w != (i = fp_skip(i, w, param))) {
            auto buf = get_dmabuffer(w * bits >> 3);
            std::int32_t len = fp_copy(buf, 0, w - i, param);
            setWindow_impl(x + i, y, x + i + len - 1, y);
            write_bytes(buf, len * bits >> 3, true);
            if (w == (i += len)) break;
          }
          param->src_x = src_x;
          param->src_y++;
        } while (++y != h);
      }
    }

