lovyan03/LovyanGFX/src/lgfx/platforms/LGFX_SPI_ESP32.hpp
    void writePixels_impl(std::int32_t length, pixelcopy_t* param) override
    {
      if (!_panel->fp_writePixels)
      {
        if (_dma_channel)
        {
          const std::uint8_t dst_bytes = _write_conv.bytes;
          std::uint32_t limit = (dst_bytes == 2) ? 16 : 12;
          std::uint32_t len;
          do {
            len = ((length - 1) % limit) + 1;
            //if (limit <= 256) limit <<= 2;
            if (limit <= 512) limit <<= 1;
            auto dmabuf = get_dmabuffer(len * dst_bytes);
            param->fp_copy(dmabuf, 0, len, param);
            write_bytes(dmabuf, len * dst_bytes, true);
          } while (length -= len);
        }
        else
        {
          write_pixels(length, param);
        }
      }
      else
      {
        _panel->fp_writePixels(_panel, this, length, param);
      }
    }

    void write_pixels(std::int32_t length, pixelcopy_t* param)
    {
      const std::uint8_t bytes = _write_conv.bytes;
      const std::uint32_t limit = (bytes == 2) ? 16 : 10; //  limit = 32/bytes (bytes==2 is 16   bytes==3 is 10)
      std::uint32_t len = (length - 1) / limit;
      std::uint32_t highpart = (len & 1) << 3;
      len = length - (len * limit);
      std::uint32_t regbuf[8];
      param->fp_copy(regbuf, 0, len, param);

      auto spi_w0_reg = _spi_w0_reg;

      std::uint32_t user_reg = *_spi_user_reg;

      dc_h();
      set_write_len(len * bytes << 3);

      memcpy((void*)&spi_w0_reg[highpart], regbuf, (len * bytes + 3) & (~3));
      if (highpart) *_spi_user_reg = user_reg | SPI_USR_MOSI_HIGHPART;
      exec_spi();
      if (0 == (length -= len)) return;

      for (; length; length -= limit) {
        param->fp_copy(regbuf, 0, limit, param);
        memcpy((void*)&spi_w0_reg[highpart ^= 0x08], regbuf, limit * bytes);
        std::uint32_t user = user_reg;
        if (highpart) user |= SPI_USR_MOSI_HIGHPART;
        if (len != limit) {
          len = limit;
          wait_spi();
          set_write_len(limit * bytes << 3);
          *_spi_user_reg = user;
          exec_spi();
        } else {
          wait_spi();
          *_spi_user_reg = user;
          exec_spi();
        }
      }
    }

    void write_bytes(const std::uint8_t* data, std::int32_t length, bool use_dma = false)
    {
      if (length <= 64) {
        auto spi_w0_reg = _spi_w0_reg;
        dc_h();
        set_write_len(length << 3);
        memcpy((void*)spi_w0_reg, data, (length + 3) & (~3));
        exec_spi();
        return;
      } else if (_dma_channel && use_dma) {
        dc_h();
        set_write_len(length << 3);
        _setup_dma_desc_links(data, length);
        *_spi_dma_out_link_reg = SPI_OUTLINK_START | ((int)(&_dmadesc[0]) & 0xFFFFF);
        spi_dma_transfer_active(_dma_channel);
        exec_spi();
        return;
      }
      constexpr std::uint32_t limit = 32;
      std::uint32_t len = ((length - 1) & 0x1F) + 1;
      std::uint32_t highpart = ((length - 1) & limit) >> 2; // 8 or 0

      auto spi_w0_reg = _spi_w0_reg;

      std::uint32_t user_reg = *_spi_user_reg;
      dc_h();
      set_write_len(len << 3);

      memcpy((void*)&spi_w0_reg[highpart], data, (len + 3) & (~3));
      if (highpart) *_spi_user_reg = user_reg | SPI_USR_MOSI_HIGHPART;
      exec_spi();
      if (0 == (length -= len)) return;

      for (; length; length -= limit) {
        data += len;
        memcpy((void*)&spi_w0_reg[highpart ^= 0x08], data, limit);
        std::uint32_t user = user_reg;
        if (highpart) user |= SPI_USR_MOSI_HIGHPART;
        if (len != limit) {
          len = limit;
          wait_spi();
          set_write_len(limit << 3);
          *_spi_user_reg = user;
          exec_spi();
        } else {
          wait_spi();
          *_spi_user_reg = user;
          exec_spi();
        }
      }
    }

    void readRect_impl(std::int32_t x, std::int32_t y, std::int32_t w, std::int32_t h, void* dst, pixelcopy_t* param) override
    {
      if (!_panel->fp_readRect)
      {
        startWrite();
        set_window(x, y, x + w - 1, y + h - 1);
        auto len = w * h;
        if (!_panel->spi_read)
        {
          memset(dst, 0, len * param->dst_bits >> 3);
        }
        else
        {
          write_cmd(_panel->getCmdRamrd());
          std::uint32_t len_dummy_read_pixel = _panel->len_dummy_read_pixel;
          start_read();
          if (len_dummy_read_pixel) {;
            set_read_len(len_dummy_read_pixel);
            exec_spi();
          }

          if (param->no_convert) {
            read_bytes((std::uint8_t*)dst, len * _read_conv.bytes);
          } else {
            read_pixels(dst, len, param);
          }
          end_read();
        }
        endWrite();
      }
      else
      {
        _panel->fp_readRect(_panel, this, x, y, w, h, dst, param);
      }
    }

    void read_pixels(void* dst, std::int32_t length, pixelcopy_t* param)
    {
      std::int32_t len1 = std::min(length, 10); // 10 pixel read
      std::int32_t len2 = len1;
      auto len_read_pixel  = _read_conv.bits;
      std::uint32_t regbuf[8];
      wait_spi();
      set_read_len(len_read_pixel * len1);
      exec_spi();
      param->src_data = regbuf;
      std::int32_t dstindex = 0;
      std::uint32_t highpart = 8;
      std::uint32_t userreg = *_spi_user_reg;
      auto spi_w0_reg = _spi_w0_reg;
      do {
        if (0 == (length -= len1)) {
          len2 = len1;
          wait_spi();
          *_spi_user_reg = userreg;
        } else {
          std::uint32_t user = userreg;
          if (highpart) user = userreg | SPI_USR_MISO_HIGHPART;
          if (length < len1) {
            len1 = length;
            wait_spi();
            set_read_len(len_read_pixel * len1);
          } else {
            wait_spi();
          }
          *_spi_user_reg = user;
          exec_spi();
        }
        memcpy(regbuf, (void*)&spi_w0_reg[highpart ^= 8], len2 * len_read_pixel >> 3);
        param->src_x = 0;
        dstindex = param->fp_copy(dst, dstindex, dstindex + len2, param);
      } while (length);
    }

    void read_bytes(std::uint8_t* dst, std::int32_t length, bool use_dma = false)
    {
      if (_dma_channel && use_dma) {
        wait_spi();
        set_read_len(length << 3);
        _setup_dma_desc_links(dst, length);
        *reg(SPI_DMA_IN_LINK_REG(_spi_port)) = SPI_INLINK_START | ((int)(&_dmadesc[0]) & 0xFFFFF);
        spi_dma_transfer_active(_dma_channel);
        exec_spi();
      } else {
        std::int32_t len1 = std::min(length, 32);  // 32 Byte read.
        std::int32_t len2 = len1;
        wait_spi();
        set_read_len(len1 << 3);
        exec_spi();
        std::uint32_t highpart = 8;
        std::uint32_t userreg = *_spi_user_reg;
        auto spi_w0_reg = _spi_w0_reg;
        do {
          if (0 == (length -= len1)) {
            len2 = len1;
            wait_spi();
            *_spi_user_reg = userreg;
          } else {
            std::uint32_t user = userreg;
            if (highpart) user = userreg | SPI_USR_MISO_HIGHPART;
            if (length < len1) {
              len1 = length;
              wait_spi();
              set_read_len(len1 << 3);
            } else {
              wait_spi();
            }
            *_spi_user_reg = user;
            exec_spi();
          }
          memcpy(dst, (void*)&spi_w0_reg[highpart ^= 8], len2);
          dst += len2;
        } while (length);
      }
//*/
    }

    static void _alloc_dmadesc(size_t len)
    {
      if (_dmadesc) heap_caps_free(_dmadesc);
      _dmadesc_len = len;
      _dmadesc = (lldesc_t*)heap_caps_malloc(sizeof(lldesc_t) * len, MALLOC_CAP_DMA);
    }

